app/Models/GeneralModel.php

SELECT *
FROM `auth_groups_users`
WHERE `user_id` = 1
---
    function user_group($id) {
        return $this->db->table('auth_groups_users')->where('user_id', $id)->get()->getRow();